{
  "description": "Legal documents: privacy policy and terms of service.",
  "resources": {
    "privacyPolicyPage": {
      "title": "Política de Privacidad de CharHub AI",
      "lastUpdatedLabel": "Última actualización",
      "lastUpdatedDate": "24 de mayo de 2025",
      "introduction": "Bienvenido a la Política de Privacidad de CharHub AI (\"nosotros\", \"nuestro\"). Esta política describe cómo recopilamos, usamos, almacenamos, compartimos y protegemos su información personal cuando utiliza nuestra plataforma CharHub AI (la \"Plataforma\"). Al utilizar la Plataforma, usted acepta la recopilación y el uso de información de acuerdo con esta política.",
      "section1": {
        "title": "1. Información que recopilamos",
        "paragraph1": "Podemos recopilar y procesar los siguientes tipos de información sobre usted:",
        "listItem1": {
          "title": "Información que usted proporciona:",
          "subItem1": "Al registrarse: Su dirección de correo electrónico, nombre de usuario (si se proporciona o se genera automáticamente), contraseña (almacenada como hash). Opcionalmente, nombre completo y fecha de nacimiento.",
          "subItem2": "Al usar Inicio de Sesión Social (Google/Facebook): Recopilamos su correo electrónico, nombre y foto de perfil según lo proporcionado y permitido por el proveedor de OAuth.",
          "subItem3": "Contenido generado por el usuario: Personajes que crea (nombre, descripción, avatar, etc.), asistentes, conversaciones de chat (mensajes de texto, indicaciones de imágenes) y archivos que carga (avatares, imágenes de entrenamiento LoRA).",
          "subItem4": "Preferencias: Su configuración, como tema, permiso para contenido NSFW e idioma preferido."
        },
        "listItem2": {
          "title": "Información recopilada automáticamente:",
          "subItem1": "Datos de uso: Información sobre cómo interactúa con la Plataforma, como las funciones utilizadas, la frecuencia y la duración de las actividades.",
          "subItem2": "Datos técnicos: Dirección IP, tipo de navegador, sistema operativo, información del dispositivo. (Recopilación estándar para la mayoría de los servicios web)."
        }
      },
      "section2": {
        "title": "2. Cómo usamos su información",
        "paragraph1": "Utilizamos la información que recopilamos para los siguientes fines:",
        "listItem1": "Proporcionar y operar la Plataforma: Autenticar usuarios, permitir la creación e interacción con personajes y asistentes, procesar sus solicitudes (como generación de texto, imágenes y audio).",
        "listItem2": "Personalizar su experiencia: Adaptar el contenido y las funciones a sus preferencias.",
        "listItem3": "Para comunicación: Enviar notificaciones importantes sobre su cuenta o actualizaciones de la Plataforma (por ejemplo, verificación de correo electrónico - a implementar).",
        "listItem4": "Para análisis y mejora: Comprender cómo se utiliza la Plataforma para mejorar nuestros servicios y desarrollar nuevas funciones.",
        "listItem5": "Para seguridad y prevención de fraudes: Proteger la integridad de la Plataforma."
      },
      "section3": {
        "title": "3. Compartir su información",
        "paragraph1": "No vendemos su información personal. Podemos compartir su información en las siguientes circunstancias:",
        "listItem1": "Con proveedores de IA de terceros: El contenido de sus interacciones (como indicaciones de texto e imagen) se envía a APIs de Modelos de Lenguaje Grandes (LLM) de terceros y otros servicios de IA (por ejemplo, OpenAI, Google, Anthropic, Groq, ComfyUI) para generar respuestas, imágenes y audio. Tomamos medidas para utilizar estos servicios de manera responsable, pero el procesamiento final ocurre en estos sistemas de terceros.",
        "listItem2": "Dentro de las conversaciones: Si participa en conversaciones con otros usuarios (funcionalidad futura) o con múltiples bots/asistentes, el contenido de esas conversaciones se comparte inherentemente entre los participantes.",
        "listItem3": "Obligaciones legales: Si así lo exige la ley, una citación u otro proceso legal, o si creemos de buena fe que la divulgación es necesaria para proteger nuestros derechos, su seguridad o la seguridad de otros, investigar fraudes o responder a una solicitud del gobierno.",
        "listItem4": "Transferencias comerciales: En caso de fusión, adquisición o venta de activos, su información puede ser transferida."
      },
      "section4": {
        "title": "4. Almacenamiento y seguridad de datos",
        "paragraph1": "Almacenamos sus datos en servidores seguros. Implementamos medidas de seguridad técnicas y organizativas para proteger su información personal contra el acceso no autorizado, la alteración, la divulgación o la destrucción. Sin embargo, ningún método de transmisión por Internet o almacenamiento electrónico es 100% seguro.",
        "paragraph2": "Las contraseñas se almacenan mediante hashing. Se utilizan tokens de acceso (JWT) para la autenticación y caducan después de un período determinado."
      },
      "section5": {
        "title": "5. Retención de datos",
        "paragraph1": "Conservaremos su información personal durante el tiempo que sea necesario para cumplir con los fines descritos en esta política, a menos que se requiera o permita un período de retención más largo por ley. Puede solicitar la eliminación de sus datos según se describe en la Sección 7."
      },
      "section6": {
        "title": "6. Sus derechos y opciones",
        "paragraph1": "Dependiendo de su jurisdicción, puede tener los siguientes derechos con respecto a su información personal:",
        "listItem1": "El derecho a acceder a la información que tenemos sobre usted.",
        "listItem2": "El derecho a corregir información inexacta.",
        "listItem3": "El derecho a solicitar la eliminación de su información.",
        "listItem4": "El derecho a restringir u oponerse al procesamiento de su información.",
        "paragraph2": "Puede actualizar parte de la información de su perfil directamente en la Plataforma. Para otras solicitudes, póngase en contacto con nosotros."
      },
      "section7": {
        "title": "7. Eliminación de datos de usuario",
        "paragraph1": {
          "textBeforeLink": "Puede solicitar la eliminación de su cuenta de CharHub AI y sus datos asociados. Para obtener instrucciones detalladas sobre cómo realizar esta solicitud, consulte nuestra página de ",
          "linkText": "Instrucciones de Eliminación de Datos",
          "textAfterLink": "."
        }
      },
      "section8": {
        "title": "8. Privacidad de los niños",
        "paragraph1": "Nuestra Plataforma no está destinada a niños menores de 14 años (o la edad mínima aplicable en su jurisdicción sin consentimiento parental). No recopilamos conscientemente información personal de niños sin el consentimiento de los padres. Si cree que un niño nos ha proporcionado información personal, póngase en contacto con nosotros."
      },
      "section9": {
        "title": "9. Cambios en esta Política de Privacidad",
        "paragraph1": "Podemos actualizar nuestra Política de Privacidad de vez en cuando. Le notificaremos cualquier cambio publicando la nueva Política de Privacidad en esta página y actualizando la fecha de \"Última actualización\" en la parte superior. Le recomendamos que revise esta Política de Privacidad periódicamente para ver si hay cambios."
      },
      "section10": {
        "title": "10. Póngase en contacto con nosotros",
        "paragraph1Prefix": "Si tiene alguna pregunta sobre esta Política de Privacidad, póngase en contacto con nosotros en:"
      }
    },
    "termsOfServicePage": {
      "title": "Términos de Servicio de CharHub AI",
      "lastUpdatedLabel": "Última actualización",
      "lastUpdatedDate": "24 de mayo de 2025",
      "introduction": {
        "text1": "¡Bienvenido a CharHub AI! Estos Términos de Servicio (\"Términos\") rigen su acceso y uso de la plataforma CharHub AI (la \"Plataforma\"), proporcionada por [Nombre de su empresa/Su nombre, si corresponde] (\"nosotros\", \"nuestro\"). Al acceder o utilizar la Plataforma, usted acepta cumplir estos Términos y nuestra ",
        "privacyPolicyLinkText": "Política de Privacidad",
        "text2": "."
      },
      "section1": {
        "title": "1. Uso de la Plataforma",
        "subSection1": {
          "title": "1.1. Elegibilidad:",
          "paragraph1": "Debe tener al menos 14 años (o la edad mínima requerida en su jurisdicción para consentir servicios en línea) para utilizar la Plataforma. Si tiene entre 14 y 18 años (o la edad de mayoría legal en su jurisdicción), usted declara que su tutor legal ha revisado y aceptado estos Términos."
        },
        "subSection2": {
          "title": "1.2. Su Cuenta:",
          "paragraph1": "Usted es responsable de mantener la confidencialidad de sus credenciales de cuenta y de todas las actividades que ocurran bajo su cuenta. Usted acepta notificarnos inmediatamente cualquier uso no autorizado de su cuenta."
        },
        "subSection3": {
          "title": "1.3. Conducta Aceptable:",
          "paragraph1": "Usted acepta no utilizar la Plataforma para:",
          "listItem1": "Violar cualquier ley o regulación aplicable.",
          "listItem2": "Generar o difundir contenido que sea ilegal, dañino, amenazante, abusivo, odioso, difamatorio, obsceno (a menos que esté permitido por la configuración NSFW y para usuarios apropiados para su edad) u objetable de otra manera.",
          "listItem3": "Infringir los derechos de propiedad intelectual de otros.",
          "listItem4": "Intentar obtener acceso no autorizado a nuestros sistemas o a las cuentas de otros usuarios.",
          "listItem5": "Interferir o interrumpir el funcionamiento de la Plataforma."
        }
      },
      "section2": {
        "title": "2. Contenido del Usuario y Contenido Generado por IA",
        "subSection1": {
          "title": "2.1. Su Contenido:",
          "paragraph1": "Usted conserva la propiedad de cualquier contenido original que cree y envíe a la Plataforma (como descripciones de personajes, indicaciones, etc.), pero nos otorga una licencia mundial, no exclusiva y libre de regalías para usar, reproducir, modificar, adaptar y mostrar dicho contenido con el fin de operar y mejorar la Plataforma."
        },
        "subSection2": {
          "title": "2.2. Contenido Generado por IA:",
          "paragraph1": "La Plataforma utiliza modelos de inteligencia artificial para generar texto, imágenes y audio (\"Contenido Generado por IA\"). Si bien puede utilizar el Contenido Generado por IA, usted comprende que es producido por sistemas de IA y puede no ser único, preciso o adecuado para todos los fines. La propiedad y los derechos de uso del Contenido Generado por IA pueden estar sujetos a los términos de los proveedores de IA de terceros."
        },
        "subSection3": {
          "title": "2.3. Responsabilidad por el Contenido:",
          "paragraph1": "Usted es el único responsable de todo el contenido que envíe o genere a través de la Plataforma y de las consecuencias de su uso. No respaldamos y no somos responsables de ningún Contenido Generado por IA."
        }
      },
      "section3": {
        "title": "3. Contenido NSFW",
        "paragraph1": "La Plataforma puede permitir la generación y visualización de contenido No Apto Para Adultos (\"NSFW\"), incluido contenido para adultos o explícito, para usuarios que cumplan los requisitos de edad (según se define en nuestra Política de Privacidad y se verifica en la medida de lo posible) y que habiliten explícitamente dicha preferencia. Usted es responsable de garantizar que su uso de las funciones NSFW cumpla con las leyes aplicables y los estándares comunitarios. Nos reservamos el derecho de moderar o eliminar contenido NSFW que viole nuestros estándares."
      },
      "section4": {
        "title": "4. Propiedad Intelectual de la Plataforma",
        "paragraph1": "La Plataforma y todos sus componentes, características y funcionalidad originales (incluidos, entre otros, el software, el texto, los gráficos, los logotipos) son y seguirán siendo la propiedad exclusiva de CharHub AI y sus licenciantes."
      },
      "section5": {
        "title": "5. Modificaciones y Terminación",
        "paragraph1": "Nos reservamos el derecho de modificar o descontinuar la Plataforma (o cualquier parte de ella) con o sin previo aviso. También podemos rescindir o suspender su acceso a la Plataforma de inmediato, sin previo aviso ni responsabilidad, por cualquier motivo, incluido el incumplimiento de estos Términos.",
        "paragraph2": "Si su cuenta es terminada, su derecho a usar la Plataforma cesará de inmediato. Las disposiciones de estos Términos que por su naturaleza deban sobrevivir a la terminación sobrevivirán a la terminación, incluidas, entre otras, las disposiciones de propiedad, las renuncias de garantía, la indemnización y las limitaciones de responsabilidad."
      },
      "section6": {
        "title": "6. Renuncia de Garantías y Limitación de Responsabilidad",
        "paragraph1": "LA PLATAFORMA SE PROPORCIONA \"TAL CUAL\" Y \"SEGÚN DISPONIBILIDAD\" SIN GARANTÍAS DE NINGÚN TIPO, EXPRESAS O IMPLÍCITAS. NO GARANTIZAMOS QUE LA PLATAFORMA SERÁ ININTERRUMPIDA, SEGURA O LIBRE DE ERRORES.",
        "paragraph2": "EN NINGÚN CASO CHARHUB AI, SUS DIRECTORES, EMPLEADOS O AFILIADOS SERÁN RESPONSABLES DE NINGÚN DAÑO INDIRECTO, INCIDENTAL, ESPECIAL, CONSECUENTE O PUNITIVO QUE SURJA DE SU USO O IMPOSIBILIDAD DE USO DE LA PLATAFORMA."
      },
      "section7": {
        "title": "7. Cambios en los Términos",
        "paragraph1": "Podemos revisar estos Términos de vez en cuando. La versión más actualizada siempre se publicará en nuestro sitio web. Al continuar utilizando la Plataforma después de que las revisiones entren en vigor, usted acepta estar sujeto a los términos revisados."
      },
      "section8": {
        "title": "8. Póngase en contacto con nosotros",
        "paragraph1Prefix": "Si tiene alguna pregunta sobre estos Términos de Servicio, póngase en contacto con nosotros en:"
      }
    }
  }
}