{
  "description": "Legal documents: privacy policy and terms of service.",
  "resources": {
    "privacyPolicyPage": {
      "title": "سياسة خصوصية CharHub AI",
      "lastUpdatedLabel": "آخر تحديث",
      "lastUpdatedDate": "24 مايو 2025",
      "introduction": "مرحبًا بك في سياسة خصوصية CharHub AI (\"نحن\"، \"لنا\"، \"خاصتنا\"). تصف هذه السياسة كيفية جمعنا لمعلوماتك الشخصية واستخدامها وتخزينها ومشاركتها وحمايتها عند استخدام منصة CharHub AI الخاصة بنا (\"المنصة\"). باستخدامك للمنصة، فإنك توافق على جمع واستخدام المعلومات وفقًا لهذه السياسة.",
      "section1": {
        "title": "1. المعلومات التي نجمعها",
        "paragraph1": "قد نقوم بجمع ومعالجة أنواع المعلومات التالية عنك:",
        "listItem1": {
          "title": "المعلومات التي تقدمها:",
          "subItem1": "عند التسجيل: عنوان بريدك الإلكتروني، اسم المستخدم (إذا تم تقديمه، أو تم إنشاؤه تلقائيًا)، كلمة المرور (مخزنة كهاش). اختياريًا، الاسم الكامل وتاريخ الميلاد.",
          "subItem2": "عند استخدام تسجيل الدخول الاجتماعي (Google/Facebook): نجمع بريدك الإلكتروني واسمك وصورة ملفك الشخصي كما يقدمها ويسمح بها موفر OAuth.",
          "subItem3": "المحتوى الذي ينشئه المستخدم: الشخصيات التي تنشئها (الاسم، الوصف، الصورة الرمزية، إلخ)، المساعدون، محادثات الدردشة (رسائل نصية، مطالبات الصور)، والملفات التي تقوم بتحميلها (صور رمزية، صور تدريب LoRA).",
          "subItem4": "التفضيلات: إعداداتك، مثل السمات، وإذن محتوى NSFW، واللغة المفضلة."
        },
        "listItem2": {
          "title": "المعلومات التي يتم جمعها تلقائيًا:",
          "subItem1": "بيانات الاستخدام: معلومات حول كيفية تفاعلك مع المنصة، مثل الميزات المستخدمة، وتكرار الأنشطة ومدتها.",
          "subItem2": "البيانات التقنية: عنوان IP، نوع المتصفح، نظام التشغيل، معلومات الجهاز. (جمع قياسي لمعظم خدمات الويب)."
        }
      },
      "section2": {
        "title": "2. كيفية استخدام معلوماتك",
        "paragraph1": "نستخدم المعلومات التي نجمعها للأغراض التالية:",
        "listItem1": "لتوفير وتشغيل المنصة: المصادقة على المستخدمين، والسماح بإنشاء والتفاعل مع الشخصيات والمساعدين، ومعالجة طلباتك (مثل توليد النصوص والصور والصوت).",
        "listItem2": "لتخصيص تجربتك: تكييف المحتوى والميزات مع تفضيلاتك.",
        "listItem3": "للتواصل: إرسال إشعارات هامة حول حسابك أو تحديثات المنصة (على سبيل المثال، التحقق من البريد الإلكتروني - سيتم تنفيذه).",
        "listItem4": "للتحليل والتحسين: فهم كيفية استخدام المنصة لتحسين خدماتنا وتطوير ميزات جديدة.",
        "listItem5": "للأمن ومنع الاحتيال: حماية سلامة المنصة."
      },
      "section3": {
        "title": "3. مشاركة معلوماتك",
        "paragraph1": "نحن لا نبيع معلوماتك الشخصية. قد نشارك معلوماتك في الظروف التالية:",
        "listItem1": "مع مزودي الذكاء الاصطناعي من أطراف ثالثة: يتم إرسال محتوى تفاعلاتك (مثل مطالبات النصوص والصور) إلى واجهات برمجة تطبيقات نماذج اللغة الكبيرة (LLM) وخدمات الذكاء الاصطناعي الأخرى من أطراف ثالثة (مثل OpenAI، Google، Anthropic، Groq، ComfyUI) لتوليد الاستجابات والصور والصوت. نتخذ خطوات لاستخدام هذه الخدمات بمسؤولية، لكن المعالجة النهائية تتم على أنظمة أطراف ثالثة هذه.",
        "listItem2": "ضمن المحادثات: إذا شاركت في محادثات مع مستخدمين آخرين (وظائف مستقبلية) أو روبوتات/مساعدين متعددين، فإن محتوى تلك المحادثات تتم مشاركته بطبيعته بين المشاركين.",
        "listItem3": "الالتزامات القانونية: إذا اقتضى القانون ذلك، أو أمر استدعاء، أو إجراء قانوني آخر، أو إذا اعتقدنا بحسن نية أن الكشف ضروري لحماية حقوقنا، أو سلامتك، أو سلامة الآخرين، أو التحقيق في الاحتيال، أو الاستجابة لطلب حكومي.",
        "listItem4": "نقل الأعمال: في حالة الاندماج، أو الاستحواذ، أو بيع الأصول، قد يتم نقل معلوماتك."
      },
      "section4": {
        "title": "4. تخزين البيانات وأمنها",
        "paragraph1": "نقوم بتخزين بياناتك على خوادم آمنة. نطبق تدابير أمنية تقنية وتنظيمية لحماية معلوماتك الشخصية ضد الوصول غير المصرح به، أو التغيير، أو الكشف، أو التدمير. ومع ذلك، لا توجد طريقة نقل عبر الإنترنت أو تخزين إلكتروني آمنة بنسبة 100%.",
        "paragraph2": "يتم تخزين كلمات المرور باستخدام التجزئة. تستخدم رموز الوصول (JWTs) للمصادقة وتنتهي صلاحيتها بعد فترة محددة."
      },
      "section5": {
        "title": "5. الاحتفاظ بالبيانات",
        "paragraph1": "سنحتفظ بمعلوماتك الشخصية طالما كان ذلك ضروريًا لتحقيق الأغراض الموضحة في هذه السياسة، ما لم تتطلب فترة احتفاظ أطول أو تسمح بها القوانين. قد تطلب حذف بياناتك كما هو موضح في القسم 7."
      },
      "section6": {
        "title": "6. حقوقك وخياراتك",
        "paragraph1": "اعتمادًا على ولايتك القضائية، قد يكون لديك الحقوق التالية فيما يتعلق بمعلوماتك الشخصية:",
        "listItem1": "الحق في الوصول إلى المعلومات التي نحتفظ بها عنك.",
        "listItem2": "الحق في تصحيح المعلومات غير الدقيقة.",
        "listItem3": "الحق في طلب حذف معلوماتك.",
        "listItem4": "الحق في تقييد أو الاعتراض على معالجة معلوماتك.",
        "paragraph2": "يمكنك تحديث بعض معلومات ملفك الشخصي مباشرة على المنصة. بالنسبة للطلبات الأخرى، يرجى الاتصال بنا."
      },
      "section7": {
        "title": "7. حذف بيانات المستخدم",
        "paragraph1": {
          "textBeforeLink": "يمكنك طلب حذف حساب CharHub AI الخاص بك والبيانات المرتبطة به. للحصول على تعليمات مفصلة حول كيفية تقديم هذا الطلب، يرجى الاطلاع على صفحة ",
          "linkText": "تعليمات حذف البيانات",
          "textAfterLink": "."
        }
      },
      "section8": {
        "title": "8. خصوصية الأطفال",
        "paragraph1": "منصتنا غير مخصصة للأطفال دون سن 14 عامًا (أو الحد الأدنى للسن المطبق في ولايتك القضائية دون موافقة الوالدين). نحن لا نجمع عن قصد معلومات شخصية من الأطفال دون موافقة الوالدين. إذا كنت تعتقد أن طفلاً قد قدم لنا معلومات شخصية، يرجى الاتصال بنا."
      },
      "section9": {
        "title": "9. التغييرات على سياسة الخصوصية هذه",
        "paragraph1": "قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنقوم بإعلامك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة وتحديث تاريخ \"آخر تحديث\" في الأعلى. نوصي بمراجعة سياسة الخصوصية هذه بشكل دوري لأي تغييرات."
      },
      "section10": {
        "title": "10. اتصل بنا",
        "paragraph1Prefix": "إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، فيرجى الاتصال بنا على:"
      }
    },
    "termsOfServicePage": {
      "title": "شروط خدمة CharHub AI",
      "lastUpdatedLabel": "آخر تحديث",
      "lastUpdatedDate": "24 مايو 2025",
      "introduction": {
        "text1": "مرحبًا بك في CharHub AI! تحكم شروط الخدمة هذه (\"الشروط\") وصولك إلى منصة CharHub AI (\"المنصة\") واستخدامك لها، والتي تقدمها [اسم شركتك/اسمك، إن أمكن] (\"نحن\"، \"لنا\"، \"خاصتنا\"). بالوصول إلى المنصة أو استخدامها، فإنك توافق على الالتزام بهذه الشروط و ",
        "privacyPolicyLinkText": "سياسة الخصوصية",
        "text2": "."
      },
      "section1": {
        "title": "1. استخدام المنصة",
        "subSection1": {
          "title": "1.1. الأهلية:",
          "paragraph1": "يجب أن يكون عمرك 14 عامًا على الأقل (أو الحد الأدنى للسن المطلوب في ولايتك القضائية للموافقة على الخدمات عبر الإنترنت) لاستخدام المنصة. إذا كنت تتراوح بين 14 و 18 عامًا (أو سن الرشد القانوني في ولايتك القضائية)، فإنك تقر بأن الوصي القانوني الخاص بك قد راجع ووافق على هذه الشروط."
        },
        "subSection2": {
          "title": "1.2. حسابك:",
          "paragraph1": "أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك وجميع الأنشطة التي تحدث تحت حسابك. توافق على إخطارنا فورًا بأي استخدام غير مصرح به لحسابك."
        },
        "subSection3": {
          "title": "1.3. السلوك المقبول:",
          "paragraph1": "توافق على عدم استخدام المنصة لـ:",
          "listItem1": "انتهاك أي قوانين أو لوائح معمول بها.",
          "listItem2": "إنشاء أو نشر محتوى غير قانوني، أو ضار، أو مهدد، أو مسيء، أو يحض على الكراهية، أو تشهيري، أو فاحش (ما لم يسمح به إعدادات NSFW وللمستخدمين المناسبين لعمرهم)، أو غير مقبول بأي شكل آخر.",
          "listItem3": "التعدي على حقوق الملكية الفكرية للآخرين.",
          "listItem4": "محاولة الحصول على وصول غير مصرح به إلى أنظمتنا أو حسابات المستخدمين الآخرين.",
          "listItem5": "التدخل في تشغيل المنصة أو تعطيله."
        }
      },
      "section2": {
        "title": "2. محتوى المستخدم والمحتوى الذي تم إنشاؤه بواسطة الذكاء الاصطناعي",
        "subSection1": {
          "title": "2.1. المحتوى الخاص بك:",
          "paragraph1": "تحتفظ بملكية أي محتوى أصلي تنشئه وتقدمه إلى المنصة (مثل أوصاف الشخصيات، والمطالبات، إلخ)، ولكنك تمنحنا ترخيصًا عالميًا، غير حصري، خالٍ من حقوق الملكية لاستخدام، ونسخ، وتعديل، وتكييف، وعرض هذا المحتوى لغرض تشغيل المنصة وتحسينها."
        },
        "subSection2": {
          "title": "2.2. المحتوى الذي تم إنشاؤه بواسطة الذكاء الاصطناعي:",
          "paragraph1": "تستخدم المنصة نماذج الذكاء الاصطناعي لتوليد النصوص والصور والصوت (\"المحتوى الذي تم إنشاؤه بواسطة الذكاء الاصطناعي\"). بينما قد تستخدم المحتوى الذي تم إنشاؤه بواسطة الذكاء الاصطناعي، فإنك تفهم أنه يتم إنتاجه بواسطة أنظمة الذكاء الاصطناعي وقد لا يكون فريدًا، أو دقيقًا، أو مناسبًا لجميع الأغراض. قد تخضع حقوق الملكية والاستخدام للمحتوى الذي تم إنشاؤه بواسطة الذكاء الاصطناعي لشروط مزودي الذكاء الاصطناعي من أطراف ثالثة."
        },
        "subSection3": {
          "title": "2.3. المسؤولية عن المحتوى:",
          "paragraph1": "أنت وحدك المسؤول عن جميع المحتوى الذي تقدمه أو تنشئه عبر المنصة وعواقب استخدامه. نحن لا نؤيد ولا نتحمل مسؤولية أي محتوى تم إنشاؤه بواسطة الذكاء الاصطناعي."
        }
      },
      "section3": {
        "title": "3. محتوى NSFW",
        "paragraph1": "قد تسمح المنصة بإنشاء وعرض محتوى غير آمن للعمل (\"NSFW\")، بما في ذلك المحتوى للبالغين أو الصريح، للمستخدمين الذين يستوفون متطلبات العمر (كما هو محدد في سياسة الخصوصية الخاصة بنا وتم التحقق منه قدر الإمكان) والذين يقومون بتمكين هذا التفضيل بشكل صريح. أنت مسؤول عن ضمان امتثال استخدامك لميزات NSFW للقوانين المعمول بها والمعايير المجتمعية. نحتفظ بالحق في الإشراف على أو إزالة محتوى NSFW الذي ينتهك معاييرنا."
      },
      "section4": {
        "title": "4. الملكية الفكرية للمنصة",
        "paragraph1": "ستظل المنصة وجميع مكوناتها وميزاتها ووظائفها الأصلية (بما في ذلك على سبيل المثال لا الحصر البرامج، النصوص، الرسوم البيانية، الشعارات) ملكية حصرية لـ CharHub AI ومرخصيها."
      },
      "section5": {
        "title": "5. التعديلات والإنهاء",
        "paragraph1": "نحتفظ بالحق في تعديل أو إيقاف المنصة (أو أي جزء منها) مع أو بدون إشعار. قد نقوم أيضًا بإنهاء أو تعليق وصولك إلى المنصة فورًا، دون إشعار مسبق أو مسؤولية، لأي سبب كان، بما في ذلك خرق هذه الشروط.",
        "paragraph2": "إذا تم إنهاء حسابك، فإن حقك في استخدام المنصة سيتوقف فورًا. ستظل الأحكام من هذه الشروط التي تستمر بحكم طبيعتها بعد الإنهاء سارية، بما في ذلك، على سبيل المثال لا الحصر، أحكام الملكية، وإخلاء المسؤولية عن الضمانات، والتعويض، وقيود المسؤولية."
      },
      "section6": {
        "title": "6. إخلاء المسؤولية عن الضمانات وقيود المسؤولية",
        "paragraph1": "يتم تقديم المنصة \"كما هي\" و\"حسب توفرها\" دون أي ضمانات من أي نوع، سواء كانت صريحة أو ضمنية. لا نضمن أن تكون المنصة غير منقطعة، أو آمنة، أو خالية من الأخطاء.",
        "paragraph2": "لن يكون CharHub AI، أو مديروها، أو موظفوها، أو الشركات التابعة لها بأي حال من الأحوال مسؤولة عن أي أضرار غير مباشرة، أو عرضية، أو خاصة، أو تبعية، أو تأديبية تنشأ عن استخدامك للمنصة أو عدم قدرتك على استخدامها."
      },
      "section7": {
        "title": "7. التغييرات على الشروط",
        "paragraph1": "قد نقوم بتعديل هذه الشروط من وقت لآخر. سيتم دائمًا نشر أحدث إصدار على موقعنا الإلكتروني. بالاستمرار في استخدام المنصة بعد سريان التعديلات، فإنك توافق على الالتزام بالشروط المعدلة."
      },
      "section8": {
        "title": "8. اتصل بنا",
        "paragraph1Prefix": "إذا كانت لديك أي أسئلة حول شروط الخدمة هذه، فيرجى الاتصال بنا على:"
      }
    }
  }
}