{
  "description": "Legal documents: privacy policy and terms of service.",
  "resources": {
    "privacyPolicyPage": {
      "title": "Informativa sulla Privacy di CharHub AI",
      "lastUpdatedLabel": "Ultimo aggiornamento",
      "lastUpdatedDate": "24 maggio 2025",
      "introduction": "Benvenuti nell'Informativa sulla Privacy di CharHub AI (\"noi\", \"nostro\"). Questa informativa descrive come raccogliamo, utilizziamo, conserviamo, condividiamo e proteggiamo le tue informazioni personali quando utilizzi la nostra piattaforma CharHub AI (la \"Piattaforma\"). Utilizzando la Piattaforma, acconsenti alla raccolta e all'uso delle informazioni in conformità con questa informativa.",
      "section1": {
        "title": "1. Informazioni che raccogliamo",
        "paragraph1": "Potremmo raccogliere ed elaborare le seguenti tipologie di informazioni su di te:",
        "listItem1": {
          "title": "Informazioni che fornisci:",
          "subItem1": "Al momento della registrazione: Il tuo indirizzo email, nome utente (se fornito o generato automaticamente), password (memorizzata come hash). Opzionalmente, nome completo e data di nascita.",
          "subItem2": "Utilizzando il Social Login (Google/Facebook): Raccogliamo la tua email, nome e immagine del profilo come forniti e consentiti dal provider OAuth.",
          "subItem3": "Contenuti generati dall'utente: Personaggi che crei (nome, descrizione, avatar, ecc.), assistenti, conversazioni di chat (messaggi di testo, richieste di immagini) e file che carichi (avatar, immagini di addestramento LoRA).",
          "subItem4": "Preferenze: Le tue impostazioni, come tema, permesso di contenuti NSFW e lingua preferita."
        },
        "listItem2": {
          "title": "Informazioni raccolte automaticamente:",
          "subItem1": "Dati di utilizzo: Informazioni su come interagisci con la Piattaforma, come le funzionalità utilizzate, la frequenza e la durata delle attività.",
          "subItem2": "Dati tecnici: Indirizzo IP, tipo di browser, sistema operativo, informazioni sul dispositivo. (Raccolta standard per la maggior parte dei servizi web)."
        }
      },
      "section2": {
        "title": "2. Come utilizziamo le tue informazioni",
        "paragraph1": "Utilizziamo le informazioni che raccogliamo per i seguenti scopi:",
        "listItem1": "Per fornire e operare la Piattaforma: Autenticare gli utenti, consentire la creazione e l'interazione con personaggi e assistenti, elaborare le tue richieste (come generazione di testo, immagini e audio).",
        "listItem2": "Per personalizzare la tua esperienza: Adattare contenuti e funzionalità alle tue preferenze.",
        "listItem3": "Per comunicazioni: Inviare notifiche importanti relative al tuo account o agli aggiornamenti della Piattaforma (ad es. verifica email - da implementare).",
        "listItem4": "Per analisi e miglioramento: Comprendere come viene utilizzata la Piattaforma per migliorare i nostri servizi e sviluppare nuove funzionalità.",
        "listItem5": "Per sicurezza e prevenzione frodi: Proteggere l'integrità della Piattaforma."
      },
      "section3": {
        "title": "3. Condivisione delle tue informazioni",
        "paragraph1": "Non vendiamo le tue informazioni personali. Potremmo condividere le tue informazioni nelle seguenti circostanze:",
        "listItem1": "Con fornitori di AI di terze parti: Il contenuto delle tue interazioni (come richieste di testo e immagini) viene inviato ad API di modelli linguistici di grandi dimensioni (LLM) di terze parti e altri servizi AI (ad es. OpenAI, Google, Anthropic, Groq, ComfyUI) per generare risposte, immagini e audio. Adottiamo misure per utilizzare questi servizi in modo responsabile, ma l'elaborazione finale avviene su questi sistemi di terze parti.",
        "listItem2": "All'interno delle conversazioni: Se partecipi a conversazioni con altri utenti (funzionalità futura) o con più bot/assistenti, il contenuto di tali conversazioni viene intrinsecamente condiviso tra i partecipanti.",
        "listItem3": "Obblighi legali: Se richiesto dalla legge, da un mandato o da un altro procedimento legale, o se crediamo in buona fede che la divulgazione sia necessaria per proteggere i nostri diritti, la tua sicurezza o la sicurezza altrui, indagare su frodi o rispondere a una richiesta governativa.",
        "listItem4": "Trasferimenti aziendali: In caso di fusione, acquisizione o vendita di attività, le tue informazioni potrebbero essere trasferite."
      },
      "section4": {
        "title": "4. Archiviazione e sicurezza dei dati",
        "paragraph1": "Memorizziamo i tuoi dati su server sicuri. Implementiamo misure di sicurezza tecniche e organizzative per proteggere le tue informazioni personali da accessi non autorizzati, alterazioni, divulgazioni o distruzione. Tuttavia, nessun metodo di trasmissione su Internet o archiviazione elettronica è sicuro al 100%.",
        "paragraph2": "Le password vengono memorizzate utilizzando l'hashing. I token di accesso (JWT) vengono utilizzati per l'autenticazione e scadono dopo un determinato periodo."
      },
      "section5": {
        "title": "5. Conservazione dei dati",
        "paragraph1": "Conserveremo le tue informazioni personali per il tempo necessario a soddisfare gli scopi delineati in questa informativa, a meno che non sia richiesto o consentito dalla legge un periodo di conservazione più lungo. Puoi richiedere la cancellazione dei tuoi dati come descritto nella Sezione 7."
      },
      "section6": {
        "title": "6. I tuoi diritti e le tue scelte",
        "paragraph1": "A seconda della tua giurisdizione, potresti avere i seguenti diritti riguardo alle tue informazioni personali:",
        "listItem1": "Il diritto di accedere alle informazioni che deteniamo su di te.",
        "listItem2": "Il diritto di correggere informazioni imprecise.",
        "listItem3": "Il diritto di richiedere la cancellazione delle tue informazioni.",
        "listItem4": "Il diritto di limitare o opporsi al trattamento delle tue informazioni.",
        "paragraph2": "Puoi aggiornare alcune delle tue informazioni del profilo direttamente sulla Piattaforma. Per altre richieste, ti preghiamo di contattarci."
      },
      "section7": {
        "title": "7. Cancellazione dei dati dell'utente",
        "paragraph1": {
          "textBeforeLink": "Puoi richiedere la cancellazione del tuo account CharHub AI e dei dati associati. Per istruzioni dettagliate su come effettuare questa richiesta, consulta la nostra pagina ",
          "linkText": "Istruzioni per la cancellazione dei dati",
          "textAfterLink": "."
        }
      },
      "section8": {
        "title": "8. Privacy dei minori",
        "paragraph1": "La nostra Piattaforma non è destinata a minori di 14 anni (o all'età minima applicabile nella tua giurisdizione senza il consenso dei genitori). Non raccogliamo consapevolmente informazioni personali da minori senza il consenso dei genitori. Se ritieni che un minore ci abbia fornito informazioni personali, ti preghiamo di contattarci."
      },
      "section9": {
        "title": "9. Modifiche a questa Informativa sulla Privacy",
        "paragraph1": "Potremmo aggiornare la nostra Informativa sulla Privacy di volta in volta. Ti informeremo di eventuali modifiche pubblicando la nuova Informativa sulla Privacy in questa pagina e aggiornando la data \"Ultimo aggiornamento\" in alto. Ti consigliamo di rivedere periodicamente questa Informativa sulla Privacy per eventuali modifiche."
      },
      "section10": {
        "title": "10. Contattaci",
        "paragraph1Prefix": "Se hai domande su questa Informativa sulla Privacy, ti preghiamo di contattarci all'indirizzo:"
      }
    },
    "termsOfServicePage": {
      "title": "Termini di Servizio di CharHub AI",
      "lastUpdatedLabel": "Ultimo aggiornamento",
      "lastUpdatedDate": "24 maggio 2025",
      "introduction": {
        "text1": "Benvenuti in CharHub AI! Questi Termini di Servizio (\"Termini\") regolano il tuo accesso e utilizzo della piattaforma CharHub AI (la \"Piattaforma\"), fornita da [Nome della tua azienda/Il tuo nome, se applicabile] (\"noi\", \"nostro\"). Accedendo o utilizzando la Piattaforma, acconsenti a rispettare questi Termini e la nostra ",
        "privacyPolicyLinkText": "Informativa sulla Privacy",
        "text2": "."
      },
      "section1": {
        "title": "1. Utilizzo della Piattaforma",
        "subSection1": {
          "title": "1.1. Idoneità:",
          "paragraph1": "Devi avere almeno 14 anni (o l'età minima richiesta nella tua giurisdizione per acconsentire ai servizi online) per utilizzare la Piattaforma. Se hai tra i 14 e i 18 anni (o l'età della maggiore età legale nella tua giurisdizione), dichiari che il tuo tutore legale ha esaminato e approvato questi Termini."
        },
        "subSection2": {
          "title": "1.2. Il tuo account:",
          "paragraph1": "Sei responsabile del mantenimento della riservatezza delle tue credenziali di accesso e di tutte le attività che si verificano sotto il tuo account. Accetti di avvisarci immediatamente di qualsiasi uso non autorizzato del tuo account."
        },
        "subSection3": {
          "title": "1.3. Condotta accettabile:",
          "paragraph1": "Accetti di non utilizzare la Piattaforma per:",
          "listItem1": "Violare leggi o regolamenti applicabili.",
          "listItem2": "Generare o diffondere contenuti illegali, dannosi, minacciosi, offensivi, odiosi, diffamatori, osceni (a meno che non sia consentito dalle impostazioni NSFW e per utenti di età appropriata) o altrimenti discutibili.",
          "listItem3": "Violare i diritti di proprietà intellettuale altrui.",
          "listItem4": "Tentare di ottenere accesso non autorizzato ai nostri sistemi o agli account di altri utenti.",
          "listItem5": "Interferire o interrompere il funzionamento della Piattaforma."
        }
      },
      "section2": {
        "title": "2. Contenuti dell'utente e contenuti generati dall'AI",
        "subSection1": {
          "title": "2.1. I tuoi contenuti:",
          "paragraph1": "Mantieni la proprietà di qualsiasi contenuto originale che crei e invii alla Piattaforma (come descrizioni di personaggi, prompt, ecc.), ma ci concedi una licenza mondiale, non esclusiva, esente da royalty per utilizzare, riprodurre, modificare, adattare e visualizzare tali contenuti allo scopo di operare e migliorare la Piattaforma."
        },
        "subSection2": {
          "title": "2.2. Contenuti generati dall'AI:",
          "paragraph1": "La Piattaforma utilizza modelli di intelligenza artificiale per generare testo, immagini e audio (\"Contenuti generati dall'AI\"). Sebbene tu possa utilizzare i Contenuti generati dall'AI, comprendi che sono prodotti da sistemi AI e potrebbero non essere unici, accurati o adatti a tutti gli scopi. La proprietà e i diritti di utilizzo dei Contenuti generati dall'AI possono essere soggetti ai termini dei fornitori di AI di terze parti."
        },
        "subSection3": {
          "title": "2.3. Responsabilità per i contenuti:",
          "paragraph1": "Sei l'unico responsabile di tutti i contenuti che invii o generi tramite la Piattaforma e delle conseguenze del loro utilizzo. Non approviamo e non siamo responsabili per alcun Contenuto generato dall'AI."
        }
      },
      "section3": {
        "title": "3. Contenuti NSFW",
        "paragraph1": "La Piattaforma può consentire la generazione e la visualizzazione di contenuti Not Safe For Work (\"NSFW\"), inclusi contenuti per adulti o espliciti, per gli utenti che soddisfano i requisiti di età (come definiti nella nostra Informativa sulla Privacy e verificati nella misura possibile) e che abilitano esplicitamente tale preferenza. Sei responsabile di garantire che il tuo utilizzo delle funzionalità NSFW sia conforme alle leggi applicabili e agli standard della comunità. Ci riserviamo il diritto di moderare o rimuovere contenuti NSFW che violano i nostri standard."
      },
      "section4": {
        "title": "4. Proprietà intellettuale della Piattaforma",
        "paragraph1": "La Piattaforma e tutti i suoi componenti originali, funzionalità e interfacce (inclusi, ma non limitati a software, testo, grafica, loghi) sono e rimarranno di proprietà esclusiva di CharHub AI e dei suoi licenziatari."
      },
      "section5": {
        "title": "5. Modifiche e cessazione",
        "paragraph1": "Ci riserviamo il diritto di modificare o interrompere la Piattaforma (o qualsiasi sua parte) con o senza preavviso. Potremmo anche terminare o sospendere il tuo accesso alla Piattaforma immediatamente, senza preavviso o responsabilità, per qualsiasi motivo, inclusa la violazione di questi Termini.",
        "paragraph2": "Se il tuo account viene terminato, il tuo diritto di utilizzare la Piattaforma cesserà immediatamente. Le disposizioni di questi Termini che per loro natura dovrebbero sopravvivere alla cessazione sopravvivranno alla cessazione, inclusi, senza limitazione, le disposizioni sulla proprietà, i disconoscimenti di garanzia, l'indennizzo e le limitazioni di responsabilità."
      },
      "section6": {
        "title": "6. Esclusione di garanzie e limitazione di responsabilità",
        "paragraph1": "LA PIATTAFORMA VIENE FORNITA \"COSÌ COM'È\" E \"COME DISPONIBILE\" SENZA GARANZIE DI ALCUN TIPO, ESPLICITE O IMPLICITE. NON GARANTIAMO CHE LA PIATTAFORMA SARÀ ININTERROTTA, SICURA O PRIVA DI ERRORI.",
        "paragraph2": "IN NESSUN CASO CHARHUB AI, I SUOI DIRETTORI, DIPENDENTI O AFFILIATE SARANNO RESPONSABILI PER QUALSIASI DANNO INDIRETTO, INCIDENTALE, SPECIALE, CONSEQUENZIALE O PUNITIVO DERIVANTE DAL TUO UTILIZZO O DALL'IMPOSSIBILITÀ DI UTILIZZARE LA PIATTAFORMA."
      },
      "section7": {
        "title": "7. Modifiche ai Termini",
        "paragraph1": "Potremmo rivedere questi Termini di volta in volta. La versione più aggiornata sarà sempre pubblicata sul nostro sito web. Continuando a utilizzare la Piattaforma dopo che le revisioni diventano effettive, accetti di essere vincolato dai termini rivisti."
      },
      "section8": {
        "title": "8. Contattaci",
        "paragraph1Prefix": "Se hai domande su questi Termini di Servizio, ti preghiamo di contattarci all'indirizzo:"
      }
    }
  }
}