{
  "description": "Legal documents: privacy policy and terms of service.",
  "resources": {
    "privacyPolicyPage": {
      "title": "CharHub AI プライバシーポリシー",
      "lastUpdatedLabel": "最終更新日",
      "lastUpdatedDate": "2025年5月24日",
      "introduction": "CharHub AI プライバシーポリシーへようこそ（「当社」、「私たち」、「弊社の」）。本ポリシーは、CharHub AI プラットフォーム（「本プラットフォーム」）をご利用いただく際に、お客様の個人情報をどのように収集、使用、保存、共有、保護するかを説明するものです。本プラットフォームをご利用いただくことにより、お客様は本ポリシーに従った情報の収集および使用に同意いただいたものとみなされます。",
      "section1": {
        "title": "1. 収集する情報",
        "paragraph1": "当社は、お客様に関して以下の種類の情報を収集および処理する場合があります。",
        "listItem1": {
          "title": "お客様が提供する情報：",
          "subItem1": "登録時：お客様のメールアドレス、ユーザー名（提供された場合、または自動生成）、パスワード（ハッシュ化して保存）。任意で、氏名と生年月日。",
          "subItem2": "ソーシャルログイン（Google/Facebook）を使用する場合：OAuthプロバイダーから提供され、許可されたメールアドレス、氏名、プロフィール写真。",
          "subItem3": "ユーザー生成コンテンツ：作成したキャラクター（名前、説明、アバターなど）、アシスタント、チャット会話（テキストメッセージ、画像プロンプト）、アップロードしたファイル（アバター、LoRAトレーニング画像）。",
          "subItem4": "設定：テーマ、NSFWコンテンツの許可、優先言語など、お客様の設定。"
        },
        "listItem2": {
          "title": "自動的に収集される情報：",
          "subItem1": "利用状況データ：利用した機能、アクティビティの頻度と期間など、お客様が本プラットフォームとどのようにやり取りするかに関する情報。",
          "subItem2": "技術データ：IPアドレス、ブラウザの種類、オペレーティングシステム、デバイス情報。（ほとんどのウェブサービスで標準的に収集される情報）。"
        }
      },
      "section2": {
        "title": "2. お客様の情報の使用方法",
        "paragraph1": "当社は、収集した情報を以下の目的で使用します。",
        "listItem1": "本プラットフォームの提供および運営：ユーザー認証、キャラクターやアシスタントの作成および対話の許可、お客様のリクエスト（テキスト、画像、音声生成など）の処理。",
        "listItem2": "お客様の体験のパーソナライズ：お客様の設定に合わせてコンテンツと機能を調整。",
        "listItem3": "コミュニケーション：アカウントやプラットフォームの更新に関する重要な通知の送信（例：メール認証 - 導入予定）。",
        "listItem4": "分析と改善：本プラットフォームの利用状況を理解し、サービスを強化し、新機能開発に役立てる。",
        "listItem5": "セキュリティと不正防止：本プラットフォームの整合性を保護。"
      },
      "section3": {
        "title": "3. お客様の情報の共有",
        "paragraph1": "当社はお客様の個人情報を販売しません。以下のような状況で、お客様の情報を共有する場合があります。",
        "listItem1": "第三者のAIプロバイダーとの共有：お客様のやり取りの内容（テキストや画像プロンプトなど）は、応答、画像、音声生成のために、第三者の大規模言語モデル（LLM）APIやその他のAIサービス（例：OpenAI、Google、Anthropic、Groq、ComfyUI）に送信されます。当社はこれらのサービスを責任を持って利用するよう努めますが、最終的な処理はこれらの第三者のシステム上で行われます。",
        "listItem2": "会話内での共有：他のユーザー（将来の機能）や複数のボット/アシスタントとの会話に参加する場合、それらの会話の内容は参加者間で本質的に共有されます。",
        "listItem3": "法的義務：法律、召喚状、その他の法的手続きにより要求された場合、または当社の権利、お客様の安全、または他者の安全を保護するために開示が必要であると誠実に判断した場合、不正行為を調査する場合、または政府からの要求に応じる場合。",
        "listItem4": "事業譲渡：合併、買収、資産売却の場合、お客様の情報が譲渡される可能性があります。"
      },
      "section4": {
        "title": "4. データ保存とセキュリティ",
        "paragraph1": "当社はお客様のデータを安全なサーバーに保存します。個人情報への不正アクセス、改ざん、開示、破壊から保護するために、技術的および組織的なセキュリティ対策を実施しています。ただし、インターネット経由の送信方法や電子ストレージは100%安全ではありません。",
        "paragraph2": "パスワードはハッシュ化して保存されます。認証にはアクセス トークン（JWT）が使用され、一定期間後に失効します。"
      },
      "section5": {
        "title": "5. データ保持",
        "paragraph1": "当社は、本ポリシーに記載された目的を達成するために必要な期間、お客様の個人情報を保持します。ただし、法律によりより長い保持期間が要求または許可される場合を除きます。お客様は、セクション7に記載されているとおり、ご自身のデータの削除を要求することができます。"
      },
      "section6": {
        "title": "6. お客様の権利と選択肢",
        "paragraph1": "お客様の管轄区域によっては、個人情報に関して以下の権利を有する場合があるます。",
        "listItem1": "当社が保有するお客様の情報にアクセスする権利。",
        "listItem2": "不正確な情報を訂正する権利。",
        "listItem3": "お客様の情報の削除を要求する権利。",
        "listItem4": "お客様の情報の処理を制限または異議を申し立てる権利。",
        "paragraph2": "お客様は、本プラットフォーム上で直接、一部のプロフィール情報を更新できます。その他のリクエストについては、当社までお問い合わせください。"
      },
      "section7": {
        "title": "7. ユーザーデータの削除",
        "paragraph1": {
          "textBeforeLink": "お客様は、CharHub AI アカウントとその関連データの削除をリクエストできます。このリクエストを行う方法の詳細については、当社の ",
          "linkText": "データ削除手順",
          "textAfterLink": " ページをご覧ください。"
        }
      },
      "section8": {
        "title": "8. 子供のプライバシー",
        "paragraph1": "当社のプラットフォームは、14歳未満（または保護者の同意なしに管轄区域で適用される最低年齢）の子供を対象としていません。当社は、保護者の同意なしに子供から個人情報を knowingly 収集することはありません。お子様が当社に個人情報を提供したと思われる場合は、当社までご連絡ください。"
      },
      "section9": {
        "title": "9. 本プライバシーポリシーの変更",
        "paragraph1": "当社は、プライバシーポリシーを随時更新する場合があります。新しいプライバシーポリシーをこのページに掲載し、冒頭の「最終更新日」を更新してお客様に通知します。変更がないか、プライバシーポリシーを定期的に確認することをお勧めします。"
      },
      "section10": {
        "title": "10. お問い合わせ",
        "paragraph1Prefix": "本プライバシーポリシーに関するご質問は、以下までお問い合わせください。"
      }
    },
    "termsOfServicePage": {
      "title": "CharHub AI 利用規約",
      "lastUpdatedLabel": "最終更新日",
      "lastUpdatedDate": "2025年5月24日",
      "introduction": {
        "text1": "CharHub AI へようこそ！本利用規約（「規約」）は、[あなたの会社名/あなたの氏名（該当する場合）]（「当社」、「私たち」、「弊社の」）が提供するCharHub AIプラットフォーム（「本プラットフォーム」）へのアクセスおよび利用を規定します。本プラットフォームにアクセスまたは利用することにより、お客様は本規約および当社の",
        "privacyPolicyLinkText": "プライバシーポリシー",
        "text2": "を遵守することに同意したものとみなされます。"
      },
      "section1": {
        "title": "1. 本プラットフォームの利用",
        "subSection1": {
          "title": "1.1. 適格性：",
          "paragraph1": "本プラットフォームを利用するには、14歳以上（または管轄区域でオンラインサービスに同意するために必要な最低年齢）である必要があります。14歳から18歳（または管轄区域での法定年齢）の間にある場合、お客様の法定代理人が本規約を確認し、同意したことを表明するものとします。"
        },
        "subSection2": {
          "title": "1.2. お客様のアカウント：",
          "paragraph1": "お客様は、アカウント資格情報の機密性を維持し、お客様のアカウントの下で発生するすべての活動について責任を負います。お客様は、お客様のアカウントの不正使用について直ちに当社に通知することに同意します。"
        },
        "subSection3": {
          "title": "1.3. 許容される行為：",
          "paragraph1": "お客様は、本プラットフォームを以下の目的で使用しないことに同意します。",
          "listItem1": "適用される法律または規制に違反すること。",
          "listItem2": "違法、有害、脅迫的、虐待的、憎悪的、中傷的、わいせつ（NSFW設定で許可され、年齢に適したユーザー向けの場合を除く）、またはその他の不快なコンテンツを生成または拡散すること。",
          "listItem3": "他者の知的財産権を侵害すること。",
          "listItem4": "当社のシステムまたは他のユーザーのアカウントへの不正アクセスを試みること。",
          "listItem5": "本プラットフォームの運営を妨害または中断すること。"
        }
      },
      "section2": {
        "title": "2. ユーザーコンテンツとAI生成コンテンツ",
        "subSection1": {
          "title": "2.1. お客様のコンテンツ：",
          "paragraph1": "お客様は、本プラットフォームに作成および送信した元のコンテンツ（キャラクターの説明、プロンプトなど）の所有権を保持しますが、本プラットフォームの運営および改善を目的として、そのコンテンツを使用、複製、変更、適応、表示するための、全世界的、非独占的、ロイヤリティフリーのライセンスを当社に付与します。"
        },
        "subSection2": {
          "title": "2.2. AI生成コンテンツ：",
          "paragraph1": "本プラットフォームは、テキスト、画像、音声（「AI生成コンテンツ」）を生成するために人工知能モデルを利用しています。AI生成コンテンツを利用できる場合でも、それがAIシステムによって生成されたものであり、ユニーク、正確、またはすべての目的に適しているとは限らないことを理解しているものとします。AI生成コンテンツの所有権および利用権は、第三者のAIプロバイダーの利用規約の対象となる場合があります。"
        },
        "subSection3": {
          "title": "2.3. コンテンツに対する責任：",
          "paragraph1": "お客様は、本プラットフォームを通じて送信または生成したすべてのコンテンツ、およびその利用結果について単独で責任を負います。当社はいかなるAI生成コンテンツも推奨せず、それについて責任を負いません。"
        }
      },
      "section3": {
        "title": "3. NSFWコンテンツ",
        "paragraph1": "本プラットフォームでは、年齢要件を満たす（プライバシーポリシーに定義され、可能な限り検証された）ユーザーが、NSFW（Not Safe For Work）コンテンツ、成人向けまたは露骨なコンテンツの生成および表示を許可する場合があります。お客様は、NSFW機能の利用が適用される法律およびコミュニティ基準に準拠していることを確認する責任があります。当社は、当社の基準に違反するNSFWコンテンツをモデレートまたは削除する権利を留保します。"
      },
      "section4": {
        "title": "4. プラットフォームの知的財産",
        "paragraph1": "本プラットフォームおよびそのすべての元のコンポーネント、機能、および機能（ソフトウェア、テキスト、グラフィック、ロゴなどを含むが、これらに限定されない）は、CharHub AI およびそのライセンサーの専有財産であり続けます。"
      },
      "section5": {
        "title": "5. 変更と終了",
        "paragraph1": "当社は、予告なく、本プラットフォーム（またはその一部）を変更または中止する権利を留保します。また、規約違反を含むいかなる理由であっても、事前の通知または責任なしに、直ちにお客様の本プラットフォームへのアクセスを終了または一時停止する場合があります。",
        "paragraph2": "お客様のアカウントが終了した場合、本プラットフォームを利用する権利は直ちに終了します。本規約のうち、性質上終了後も存続すべき条項（所有権条項、保証の免責、補償、責任の制限などを含むが、これらに限定されない）は、終了後も存続するものとします。"
      },
      "section6": {
        "title": "6. 保証の免責および責任の制限",
        "paragraph1": "本プラットフォームは、「現状有姿」および「利用可能な状態」で提供され、明示的または黙示的な、いかなる種類の保証も行いません。当社は、本プラットフォームが中断されない、安全である、またはエラーがないことを保証しません。",
        "paragraph2": "いかなる場合も、CharHub AI、その取締役、従業員、または関連会社は、お客様が本プラットフォームを使用または使用できないことから生じる、間接的、偶発的、特別、結果的、または懲罰的な損害について、一切責任を負わないものとします。"
      },
      "section7": {
        "title": "7. 規約の変更",
        "paragraph1": "当社は、本規約を随時改定する場合があります。最新版は常に当社のウェブサイトに掲載されます。改定が有効になった後も本プラットフォームを継続して利用することにより、お客様は改定された規約に拘束されることに同意したものとみなされます。"
      },
      "section8": {
        "title": "8. お問い合わせ",
        "paragraph1Prefix": "本利用規約に関するご質問は、以下までお問い合わせください。"
      }
    }
  }
}