{
  "description": "Legal documents: privacy policy and terms of service.",
  "resources": {
    "privacyPolicyPage": {
      "title": "Политика конфиденциальности CharHub AI",
      "lastUpdatedLabel": "Последнее обновление",
      "lastUpdatedDate": "24 мая 2025 г.",
      "introduction": "Добро пожаловать в Политику конфиденциальности CharHub AI («мы», «нас», «наш»). Настоящая политика описывает, как мы собираем, используем, храним, передаем и защищаем вашу личную информацию при использовании нашей платформы CharHub AI («Платформа»). Используя Платформу, вы соглашаетесь на сбор и использование информации в соответствии с настоящей политикой.",
      "section1": {
        "title": "1. Собираемая нами информация",
        "paragraph1": "Мы можем собирать и обрабатывать следующие типы информации о вас:",
        "listItem1": {
          "title": "Информация, которую вы предоставляете:",
          "subItem1": "При регистрации: ваш адрес электронной почты, имя пользователя (если указано или сгенерировано автоматически), пароль (хранится в виде хэша). Опционально: полное имя и дата рождения.",
          "subItem2": "При использовании входа через социальные сети (Google/Facebook): мы собираем ваш адрес электронной почты, имя и изображение профиля, предоставленные и разрешенные поставщиком OAuth.",
          "subItem3": "Контент, созданный пользователем: созданные вами персонажи (имя, описание, аватар и т. д.), ассистенты, истории чатов (текстовые сообщения, запросы на изображения) и загруженные вами файлы (аватары, изображения для обучения LoRA).",
          "subItem4": "Предпочтения: ваши настройки, такие как тема, разрешение на контент NSFW и предпочтительный язык."
        },
        "listItem2": {
          "title": "Информация, собираемая автоматически:",
          "subItem1": "Данные об использовании: информация о том, как вы взаимодействуете с Платформой, например, какие функции используются, частота и продолжительность действий.",
          "subItem2": "Технические данные: IP-адрес, тип браузера, операционная система, информация об устройстве. (Стандартный сбор для большинства веб-сервисов)."
        }
      },
      "section2": {
        "title": "2. Как мы используем вашу информацию",
        "paragraph1": "Мы используем собранную нами информацию для следующих целей:",
        "listItem1": "Предоставление и эксплуатация Платформы: аутентификация пользователей, обеспечение создания персонажей и ассистентов и взаимодействия с ними, обработка ваших запросов (например, генерация текста, изображений и аудио).",
        "listItem2": "Персонализация вашего опыта: адаптация контента и функций к вашим предпочтениям.",
        "listItem3": "Для связи: отправка важных уведомлений о вашей учетной записи или обновлениях Платформы (например, подтверждение электронной почты — будет реализовано).",
        "listItem4": "Для анализа и улучшения: понимание того, как используется Платформа, для улучшения наших услуг и разработки новых функций.",
        "listItem5": "Для обеспечения безопасности и предотвращения мошенничества: защита целостности Платформы."
      },
      "section3": {
        "title": "3. Передача вашей информации",
        "paragraph1": "Мы не продаем вашу личную информацию. Мы можем передавать вашу информацию при следующих обстоятельствах:",
        "listItem1": "Сторонним поставщикам ИИ: содержимое ваших взаимодействий (например, текстовые запросы и запросы на изображения) отправляется сторонним API больших языковых моделей (LLM) и другим ИИ-сервисам (например, OpenAI, Google, Anthropic, Groq, ComfyUI) для генерации ответов, изображений и аудио. Мы принимаем меры для ответственного использования этих услуг, но окончательная обработка происходит в этих сторонних системах.",
        "listItem2": "В рамках разговоров: если вы участвуете в разговорах с другими пользователями (будущая функциональность) или несколькими ботами/ассистентами, содержимое этих разговоров по своей сути передается между участниками.",
        "listItem3": "Юридические обязательства: если это требуется по закону, повесткой в суд или другим юридическим процессом, или если мы добросовестно полагаем, что раскрытие информации необходимо для защиты наших прав, вашей безопасности или безопасности других лиц, расследования мошенничества или ответа на запрос правительства.",
        "listItem4": "Передача бизнеса: в случае слияния, поглощения или продажи активов ваша информация может быть передана."
      },
      "section4": {
        "title": "4. Хранение данных и безопасность",
        "paragraph1": "Мы храним ваши данные на защищенных серверах. Мы внедряем технические и организационные меры безопасности для защиты вашей личной информации от несанкционированного доступа, изменения, раскрытия или уничтожения. Однако ни один метод передачи через Интернет или электронного хранения не является на 100% безопасным.",
        "paragraph2": "Пароли хранятся с использованием хэширования. Токены доступа (JWT) используются для аутентификации и истекают через определенный период времени."
      },
      "section5": {
        "title": "5. Хранение данных",
        "paragraph1": "Мы будем хранить вашу личную информацию в течение срока, необходимого для достижения целей, изложенных в настоящей политике, если более длительный срок хранения не требуется или не разрешен законом. Вы можете запросить удаление своих данных, как описано в Разделе 7."
      },
      "section6": {
        "title": "6. Ваши права и выбор",
        "paragraph1": "В зависимости от вашей юрисдикции вы можете иметь следующие права в отношении своей личной информации:",
        "listItem1": "Право доступа к информации, которую мы храним о вас.",
        "listItem2": "Право на исправление неточной информации.",
        "listItem3": "Право требовать удаления вашей информации.",
        "listItem4": "Право ограничить или возражать против обработки вашей информации.",
        "paragraph2": "Вы можете обновить некоторую информацию своего профиля непосредственно на Платформе. По другим запросам, пожалуйста, свяжитесь с нами."
      },
      "section7": {
        "title": "7. Удаление данных пользователя",
        "paragraph1": {
          "textBeforeLink": "Вы можете запросить удаление своей учетной записи CharHub AI и связанных с ней данных. Подробные инструкции о том, как сделать этот запрос, см. на нашей ",
          "linkText": "странице «Инструкции по удалению данных»",
          "textAfterLink": "."
        }
      },
      "section8": {
        "title": "8. Конфиденциальность детей",
        "paragraph1": "Наша Платформа не предназначена для детей младше 14 лет (или применимого минимального возраста в вашей юрисдикции без согласия родителей). Мы не собираем сознательно личную информацию детей без согласия родителей. Если вы считаете, что ребенок предоставил нам личную информацию, пожалуйста, свяжитесь с нами."
      },
      "section9": {
        "title": "9. Изменения в настоящей Политике конфиденциальности",
        "paragraph1": "Мы можем время от времени обновлять нашу Политику конфиденциальности. Мы уведомим вас о любых изменениях, опубликовав новую Политику конфиденциальности на этой странице и обновив дату «Последнее обновление» вверху. Мы рекомендуем вам периодически просматривать настоящую Политику конфиденциальности на предмет любых изменений."
      },
      "section10": {
        "title": "10. Свяжитесь с нами",
        "paragraph1Prefix": "Если у вас есть какие-либо вопросы относительно настоящей Политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу:"
      }
    },
    "termsOfServicePage": {
      "title": "Условия обслуживания CharHub AI",
      "lastUpdatedLabel": "Последнее обновление",
      "lastUpdatedDate": "24 мая 2025 г.",
      "introduction": {
        "text1": "Добро пожаловать в CharHub AI! Настоящие Условия обслуживания («Условия») регулируют ваш доступ к платформе CharHub AI («Платформа») и ее использование, предоставляемой [Название вашей компании/Ваше имя, если применимо] («мы», «нас», «наш»). Получая доступ к Платформе или используя ее, вы соглашаетесь соблюдать настоящие Условия и нашу ",
        "privacyPolicyLinkText": "Политику конфиденциальности",
        "text2": "."
      },
      "section1": {
        "title": "1. Использование Платформы",
        "subSection1": {
          "title": "1.1. Право на участие:",
          "paragraph1": "Для использования Платформы вам должно быть не менее 14 лет (или минимальный возраст, необходимый в вашей юрисдикции для согласия на онлайн-сервисы). Если вам от 14 до 18 лет (или до совершеннолетия в вашей юрисдикции), вы подтверждаете, что ваш законный представитель ознакомился с настоящими Условиями и согласился с ними."
        },
        "subSection2": {
          "title": "1.2. Ваша учетная запись:",
          "paragraph1": "Вы несете ответственность за конфиденциальность учетных данных вашей учетной записи и за все действия, происходящие под вашей учетной записью. Вы соглашаетесь немедленно уведомлять нас о любом несанкционированном использовании вашей учетной записи."
        },
        "subSection3": {
          "title": "1.3. Допустимое поведение:",
          "paragraph1": "Вы соглашаетесь не использовать Платформу для:",
          "listItem1": "Нарушения каких-либо применимых законов или правил.",
          "listItem2": "Генерации или распространения контента, который является незаконным, вредным, угрожающим, оскорбительным, ненавистническим, дискредитирующим, непристойным (если это разрешено настройками NSFW и для пользователей соответствующего возраста) или иным образом неприемлемым.",
          "listItem3": "Нарушения прав интеллектуальной собственности других лиц.",
          "listItem4": "Попыток получить несанкционированный доступ к нашим системам или учетным записям других пользователей.",
          "listItem5": "Вмешательства или нарушения работы Платформы."
        }
      },
      "section2": {
        "title": "2. Контент пользователя и контент, сгенерированный ИИ",
        "subSection1": {
          "title": "2.1. Ваш контент:",
          "paragraph1": "Вы сохраняете право собственности на любой оригинальный контент, который вы создаете и отправляете на Платформу (например, описания персонажей, запросы и т. д.), но вы предоставляете нам всемирную, неисключительную, безвозмездную лицензию на использование, воспроизведение, модификацию, адаптацию и отображение такого контента для целей эксплуатации и улучшения Платформы."
        },
        "subSection2": {
          "title": "2.2. Контент, сгенерированный ИИ:",
          "paragraph1": "Платформа использует модели искусственного интеллекта для генерации текста, изображений и аудио («Контент, сгенерированный ИИ»). Хотя вы можете использовать Контент, сгенерированный ИИ, вы понимаете, что он производится системами ИИ и может быть не уникальным, не точным или не подходящим для всех целей. Владение и права на использование Контента, сгенерированного ИИ, могут регулироваться условиями сторонних поставщиков ИИ."
        },
        "subSection3": {
          "title": "2.3. Ответственность за контент:",
          "paragraph1": "Вы несете единоличную ответственность за весь контент, который вы отправляете или генерируете через Платформу, и за последствия его использования. Мы не одобряем и не несем ответственности за какой-либо Контент, сгенерированный ИИ."
        }
      },
      "section3": {
        "title": "3. Контент NSFW",
        "paragraph1": "Платформа может разрешать генерацию и просмотр контента «Не для работы» (NSFW), включая контент для взрослых или откровенный контент, для пользователей, соответствующих возрастным требованиям (как определено в нашей Политике конфиденциальности и подтверждено, насколько это возможно), и которые явно включили такую настройку. Вы несете ответственность за обеспечение соответствия использования функций NSFW применимым законам и общественным нормам. Мы оставляем за собой право модерировать или удалять контент NSFW, который нарушает наши стандарты."
      },
      "section4": {
        "title": "4. Интеллектуальная собственность Платформы",
        "paragraph1": "Платформа и все ее оригинальные компоненты, функции и возможности (включая, но не ограничиваясь программным обеспечением, текстом, графикой, логотипами) являются и останутся исключительной собственностью CharHub AI и ее лицензиаров."
      },
      "section5": {
        "title": "5. Изменения и прекращение действия",
        "paragraph1": "Мы оставляем за собой право изменять или прекращать работу Платформы (или любой ее части) с уведомлением или без него. Мы также можем немедленно прекратить или приостановить ваш доступ к Платформе без предварительного уведомления или ответственности по любой причине, включая нарушение настоящих Условий.",
        "paragraph2": "Если ваша учетная запись будет прекращена, ваше право на использование Платформы немедленно прекратится. Положения настоящих Условий, которые по своему характеру должны оставаться в силе после прекращения действия, останутся в силе после прекращения действия, включая, без ограничений, положения о собственности, отказ от гарантий, возмещение убытков и ограничение ответственности."
      },
      "section6": {
        "title": "6. Отказ от гарантий и ограничение ответственности",
        "paragraph1": "ПЛАТФОРМА ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ» И «КАК ДОСТУПНО» БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ. МЫ НЕ ГАРАНТИРУЕМ, ЧТО ПЛАТФОРМА БУДЕТ НЕПРЕРЫВНОЙ, БЕЗОПАСНОЙ ИЛИ БЕЗОШИБОЧНОЙ.",
        "paragraph2": "НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ CHARHUB AI, ЕЕ ДИРЕКТОРА, СОТРУДНИКИ ИЛИ АФФИЛИРОВАННЫЕ ЛИЦА НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, КОСВЕННЫЕ ИЛИ ШТРАФНЫЕ УБЫТКИ, ВОЗНИКАЮЩИЕ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ВАМИ ПЛАТФОРМЫ ИЛИ НЕВОЗМОЖНОСТИ ЕЕ ИСПОЛЬЗОВАНИЯ."
      },
      "section7": {
        "title": "7. Изменения в Условиях",
        "paragraph1": "Мы можем время от времени пересматривать настоящие Условия. Самая актуальная версия всегда будет размещена на нашем веб-сайте. Продолжая использовать Платформу после вступления в силу изменений, вы соглашаетесь соблюдать измененные условия."
      },
      "section8": {
        "title": "8. Свяжитесь с нами",
        "paragraph1Prefix": "Если у вас есть какие-либо вопросы относительно настоящих Условий обслуживания, пожалуйста, свяжитесь с нами по адресу:"
      }
    }
  }
}